app/controllers/categories_controller.rb

SELECT * FROM `menus` WHERE (`menus`.`id` = 9)
INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `user_id`, `menu_id`) VALUES('postres', '2009-11-23 21:38:59', '2009-11-23 21:38:59', NULL, 13)
---
  def create
    @category=Category.new(params[:category])
    @menu=Menu.find(params[:menu_id])
    @category.menu=@menu

    if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 7)
UPDATE `categories` SET `updated_at` = '2009-11-23 22:01:16', `name` = 'postres !' WHERE `id` = 7
---
  def update

    @category = Category.find(params[:id])

      if @category.update_attributes(params[:category])

SELECT * FROM `categories` WHERE (`categories`.`id` = 4)
DELETE FROM `categories` WHERE `id` = 4
---
  def destroy

    @category = Category.find(params[:id])

      @category.destroy