app/controllers/dishes_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
INSERT INTO `dishes` (`name`, `price`, `created_at`, `photo_file_size`, `updated_at`, `photo_file_name`, `photo_content_type`, `user_id`, `category_id`, `description`) VALUES('fsf', 12300, '2009-11-23 21:00:10', 11951, '2009-11-23 21:00:10', 'Alien_1.bmp', 'image/bmp', NULL, 4, 'fsf')
---
  def create
    @dish=Dish.new(params[:dish])
    @category=Category.find(params[:category_id])
    @dish.category=@category

    if @dish.save