app/controllers/menus_controller.rb

SELECT * FROM `menus`
---
  def index
    @menus = Menu.all

SELECT * FROM `menus` WHERE (`menus`.`id` = 8)
---
  def show
    @menu = Menu.find(params[:id])

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 1)
INSERT INTO `menus` (`created_at`, `updated_at`, `about`, `user_id`, `restaurant_id`) VALUES('2009-11-23 21:37:37', '2009-11-23 21:37:37', 'menu del dia', NULL, 9)
---
  def create
    @menu=Menu.new(params[:menu])
    @restaurant=Restaurant.find(params[:restaurant_id])
    @menu.restaurant=@restaurant
    if @menu.save

SELECT * FROM `menus` WHERE (`menus`.`id` = 13)
DELETE FROM `menus` WHERE `id` = 13
---
  def destroy

    @menu = Menu.find(params[:id])

      @menu.destroy