app/controllers/restaurants_controller.rb

SELECT * FROM `restaurants` WHERE (name_restaurant LIKE 'r%')
---
 def index
    @restaurants = Restaurant.all

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 0)
---
  def show
     @restaurant = Restaurant.find(params[:id])

INSERT INTO `restaurants` (`created_at`, `updated_at`, `about`, `user_id`, `name_restaurant`) VALUES('2009-11-23 02:04:59', '2009-11-23 02:04:59', 'all', 6, 'food')
---
  def create
    @restaurant = Restaurant.new params[:restaurant]
    if @restaurant.save

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 7)
---
  def edit
    @restaurant = Restaurant.find(params[:id])

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 7)
UPDATE `restaurants` SET `updated_at` = '2009-11-23 02:19:30', `about` = 'abcsd' WHERE `id` = 9
---
  def update
     @restaurant = Restaurant.find(params[:id])

    if @restaurant.update_attributes(params[:restaurant])

SELECT * FROM `restaurants` WHERE (`restaurants`.`id` = 1)
DELETE FROM `restaurants` WHERE `id` = 1
---
  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy